[
    {
        "fact": "My favourite subject in high school was Physics, but it is too hard."
    },
    {
        "fact": "I failed Biology for entire year in sec school, but I still got A in O-level Biology."
    },
    {
        "fact": "I am good at swimming, but I don't know how to dive until now."
    },
    {
        "fact": "I invented the Theory of Playing Pool and it always worked. However, neither my friends and I don't know what exactly the theory is."
    },
    {
        "fact": "History is an only subject I have talents in, among those Art subjects."
    },
    {
        "fact": "I want to be a game developer in the near future."
    },
    {
        "fact": "My height stopped growing since I was 16 years old."
    },
    {
        "fact": "I like playing computer games because it feels more \"real\" in the unreal world."
    },
    {
        "fact": "I like eating Box B in McDonald, but it is not sold in Canada."
    },
    {
        "fact": "I like the chili sause in chicken rice."
    },
    {
        "fact": "I can't eat pickle."
    },
    {
        "fact": "My favourite game is Witcher 3."
    },
    {
        "fact": "I believe \"The best is yet to be\"."
    },
    {
        "fact": "I have bad memory, so I am bad in language subject."
    },
    {
        "fact": "I wanted to study business for university. But I realized I would have no startup fund."
    },
    {
        "fact": "I don't like strawberry ice-cream, strawberry snacks and strawberry..."
    },
    {
        "fact": "I keep forgetting people's name"
    },
    {
        "fact": "My record of longest sleep length is 14 hours."
    },
    {
        "fact": "I prefer sweet pop-corn."
    },
    {
        "fact": "I like drinking Coke Diet than Coke Zero."
    },
    {
        "fact": "I like playing League of Legend Aram."
    },
    {
        "fact": "I have been to more than ten countries."
    },
    {
        "fact": "I believe everybody has a destiny, but one can choose the attitudes to face it."
    },
    {
        "fact": "I am addicted to The Legend of Zelda: Breath of the Wild."
    },
    {
        "fact": "I can cook, but only eatable by myself."
    }
]